In [1]:
import pandas as pd
import numpy as np

In [2]:
weight_loss=pd.read_csv('data/weight_loss.csv')

In [3]:
weight_loss.head()

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283

In [4]:
weight_loss.query('Month=="Jan"')

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283
5  Amy   Jan  Week 3     189
6  Bob   Jan  Week 4     283
7  Amy   Jan  Week 4     190

In [5]:
def find_perc_loss(s):
    return (s-s.iloc[0])/s.iloc[0]

In [6]:
# transforming without Pandas method, just with function

In [7]:
bob_jan=weight_loss.query('Name=="Bob" and Month=="Jan"')

In [8]:
find_perc_loss(bob_jan['Weight'])

0    0.000000
2   -0.010309
4   -0.027491
6   -0.027491
Name: Weight, dtype: float64

In [9]:
# usage of .transform() with groupby method

In [10]:
grouped=weight_loss.groupby(['Name','Month'])['Weight']
pcnt_loss=grouped.transform(find_perc_loss)
pcnt_loss.head(8)

0    0.000000
1    0.000000
2   -0.010309
3   -0.040609
4   -0.027491
5   -0.040609
6   -0.027491
7   -0.035533
Name: Weight, dtype: float64

In [11]:
from IPython.display import display

In [12]:
grouped=weight_loss.groupby(['Name','Month'])

In [13]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [14]:
for name,group in grouped:
    print(name)
    display(group)

('Amy', 'Apr')

   Name Month    Week  Weight
25  Amy   Apr  Week 1     170
27  Amy   Apr  Week 2     164
29  Amy   Apr  Week 3     164
31  Amy   Apr  Week 4     161

('Amy', 'Feb')

   Name Month    Week  Weight
9   Amy   Feb  Week 1     190
11  Amy   Feb  Week 2     184
13  Amy   Feb  Week 3     177
15  Amy   Feb  Week 4     173

('Amy', 'Jan')

  Name Month    Week  Weight
1  Amy   Jan  Week 1     197
3  Amy   Jan  Week 2     189
5  Amy   Jan  Week 3     189
7  Amy   Jan  Week 4     190

('Amy', 'Mar')

   Name Month    Week  Weight
17  Amy   Mar  Week 1     173
19  Amy   Mar  Week 2     173
21  Amy   Mar  Week 3     170
23  Amy   Mar  Week 4     170

('Bob', 'Apr')

   Name Month    Week  Weight
24  Bob   Apr  Week 1     261
26  Bob   Apr  Week 2     258
28  Bob   Apr  Week 3     253
30  Bob   Apr  Week 4     250

('Bob', 'Feb')

   Name Month    Week  Weight
8   Bob   Feb  Week 1     283
10  Bob   Feb  Week 2     275
12  Bob   Feb  Week 3     268
14  Bob   Feb  Week 4     268

('Bob', 'Jan')

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
2  Bob   Jan  Week 2     288
4  Bob   Jan  Week 3     283
6  Bob   Jan  Week 4     283

('Bob', 'Mar')

   Name Month    Week  Weight
16  Bob   Mar  Week 1     268
18  Bob   Mar  Week 2     271
20  Bob   Mar  Week 3     265
22  Bob   Mar  Week 4     261

In [15]:
grouped.groups.keys()

dict_keys([('Amy', 'Apr'), ('Amy', 'Feb'), ('Amy', 'Jan'), ('Amy', 'Mar'), ('Bob', 'Apr'), ('Bob', 'Feb'), ('Bob', 'Jan'), ('Bob', 'Mar')])

In [16]:
grouped.ngroups

8

In [17]:
grouped.get_group(('Bob','Mar'))

   Name Month    Week  Weight
16  Bob   Mar  Week 1     268
18  Bob   Mar  Week 2     271
20  Bob   Mar  Week 3     265
22  Bob   Mar  Week 4     261

In [18]:
weight_loss['Perc Weight Loss']=pcnt_loss.round(3)

In [20]:
week4=weight_loss.query('Week=="Week 4"')
week4

   Name Month    Week  Weight  Perc Weight Loss
6   Bob   Jan  Week 4     283            -0.027
7   Amy   Jan  Week 4     190            -0.036
14  Bob   Feb  Week 4     268            -0.053
15  Amy   Feb  Week 4     173            -0.089
22  Bob   Mar  Week 4     261            -0.026
23  Amy   Mar  Week 4     170            -0.017
30  Bob   Apr  Week 4     250            -0.042
31  Amy   Apr  Week 4     161            -0.053

In [23]:
# transforming DF with pivot table

In [24]:
winner=week4.pivot('Month','Name','Perc Weight Loss')
winner

Name     Amy    Bob
Month
Apr   -0.053 -0.042
Feb   -0.089 -0.053
Jan   -0.036 -0.027
Mar   -0.017 -0.026

In [26]:
winner['Winner']=np.where(winner['Amy']<winner['Bob'],'Amy','Bob')
winner

Name     Amy    Bob Winner
Month
Apr   -0.053 -0.042    Amy
Feb   -0.089 -0.053    Amy
Jan   -0.036 -0.027    Amy
Mar   -0.017 -0.026    Bob

In [27]:
winner.style.highlight_min(axis=1,color="blue")

In [28]:
winner.Winner.value_counts()

Amy    3
Bob    1
Name: Winner, dtype: int64